examples/porousHeatTransferFoam/PCMValidations/GR41/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    heatingCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-1000 2.5 -1000) (1000 7.5 1000);
    }
    {
        name    heatSource;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     heatingCellSet;
    }

    // porousBlockage
    {
        name    porousBlockageCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-1000 -1000 -1000) (1000 1000 1000);
    }
    {
        name    porousBlockage;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     porousBlockageCellSet;
    }
);

// ************************************************************************* //
